{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "1047e01a-a95c-4e73-a2d5-56ebd5b6e77e",
   "metadata": {},
   "source": [
    "# Summary 5"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "009a442e-a2da-45c7-bcf7-8090922eba48",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5b2f2b36-026d-4dba-b800-5dbcfbbcb8f4",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "4830ce1f-ea3d-43f7-aa1e-3260512582ad",
   "metadata": {},
   "source": [
    "### Разбор ДЗ 9"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "36f6ff28-3288-4203-b937-823d2c5d7deb",
   "metadata": {},
   "source": [
    "1. Таблица умножения  \n",
    "Напишите программу, которая выводит таблицу умножения для чисел от 1 до n. Где n это число, которое введет пользователь.   Оформите вывод так, чтобы столбцы были ровные (число ровно под числом)  \n",
    "Пример вывода:\n",
    "```\n",
    "Введите число: 5  \n",
    "1\t2\t3\t4\t5\t  \n",
    "2\t4\t6\t8\t10\t  \n",
    "3\t6\t9\t12\t15\t  \n",
    "4\t8\t12\t16\t20\t  \n",
    "5\t10\t15\t20\t25\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "d805f434-a448-408d-a572-607ef0099229",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      " 5\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\t2\t3\t4\t5\t\n",
      "2\t4\t6\t8\t10\t\n",
      "3\t6\t9\t12\t15\t\n",
      "4\t8\t12\t16\t20\t\n",
      "5\t10\t15\t20\t25\t\n"
     ]
    }
   ],
   "source": [
    "n = int(input())\n",
    "\n",
    "for i in range(1,n+1): #i - строка\n",
    "    for j in range(1,n+1):#j - столбцы\n",
    "        print(i*j, end='\\t')\n",
    "    print()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "888f7550-f6d7-44ab-ba82-873d883d16c2",
   "metadata": {},
   "source": [
    "2. Лестница чисел\n",
    "Напишите программу, которая принимает число n и выводит \"лестницу\" из чисел. Каждая строка лестницы содержит числа от 1 до номера строки.\n",
    "```\n",
    "Пример вывода:\n",
    "Введите число: 5  \n",
    "1  \n",
    "1 2  \n",
    "1 2 3  \n",
    "1 2 3 4  \n",
    "1 2 3 4 5\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "5272890c-d339-47a3-80c7-d870ccc7c25b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      " 15\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1\t\n",
      "1\t2\t\n",
      "1\t2\t3\t\n",
      "1\t2\t3\t4\t\n",
      "1\t2\t3\t4\t5\t\n",
      "1\t2\t3\t4\t5\t6\t\n",
      "1\t2\t3\t4\t5\t6\t7\t\n",
      "1\t2\t3\t4\t5\t6\t7\t8\t\n",
      "1\t2\t3\t4\t5\t6\t7\t8\t9\t\n",
      "1\t2\t3\t4\t5\t6\t7\t8\t9\t10\t\n",
      "1\t2\t3\t4\t5\t6\t7\t8\t9\t10\t11\t\n",
      "1\t2\t3\t4\t5\t6\t7\t8\t9\t10\t11\t12\t\n",
      "1\t2\t3\t4\t5\t6\t7\t8\t9\t10\t11\t12\t13\t\n",
      "1\t2\t3\t4\t5\t6\t7\t8\t9\t10\t11\t12\t13\t14\t\n",
      "1\t2\t3\t4\t5\t6\t7\t8\t9\t10\t11\t12\t13\t14\t15\t\n"
     ]
    }
   ],
   "source": [
    "n = int(input())\n",
    "\n",
    "for i in range(1,n+1): #i - строка\n",
    "    for j in range(1,i+1):#j - столбцы\n",
    "        print(j, end='\\t')\n",
    "    print()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "35814bfd-cd4e-4aa3-b211-c92bacdc8916",
   "metadata": {},
   "source": [
    "3. Удаление всех повторяющихся символов  \n",
    "Напишите программу, которая принимает строку и удаляет из неё все повторяющиеся символы, сохраняя только первые их вхождения.\n",
    "Пример вывода:  \n",
    "Введите строку: Python programming   \n",
    "Результат: Python prgami  \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "16c2be1b-7d80-4c87-be05-b597a178d64d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      " Python programming\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Python prgami\n"
     ]
    }
   ],
   "source": [
    "text = input()\n",
    "\n",
    "res = ''\n",
    "\n",
    "for char in text:\n",
    "    if char not in res:\n",
    "        res+=char\n",
    "\n",
    "print(res)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6661b9f4-16a6-430a-af0f-272faa494678",
   "metadata": {},
   "source": [
    "### ДЗ 10"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ee873ad0-16e7-4f66-b93c-41681328d4bf",
   "metadata": {},
   "source": [
    "1. Создание списка с пользовательскими данными\n",
    "Напишите программу, которая принимает список целых чисел от пользователя и добавляет каждое число в динамический массив. Программа должна принимать новое число от пользователя и добавлять его в динамический массив до тех пор, пока пользователь не введет команду \"Выход\". Выведите итоговый динамический массив на экран с помощью команды print.\n",
    "\n",
    "Пример вывода:  \n",
    "```\n",
    "Введите число или 'выход':: 1\n",
    "Введите число или 'выход':: 2\n",
    "Введите число или 'выход':: выход\n",
    "Итоговый динамический массив: [1, 2]\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9a07bcc5-ce5c-4eb7-a8f9-bdc939a1dd48",
   "metadata": {},
   "outputs": [],
   "source": [
    "res = []\n",
    "num = input()\n",
    "\n",
    "while text != 'выход':\n",
    "    res += [int(num)]\n",
    "    num = input()\n",
    "print(res)\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "25b2f68b-a8e5-49dc-bc36-babc8b4607c8",
   "metadata": {},
   "source": [
    "2. Квадрат нечетных чисел\n",
    "Напишите программу, которая изменяет изначальный список и возводит в квадрат только нечётные числа.\n",
    "numbers = [4, 9, 1, 7, 2, 5, 0, 3, 7, 1, 3]  \n",
    "Пример вывода:  \n",
    "Изначальный список: [4, 9, 1, 7, 2, 5, 0, 3, 7, 1, 3]  \n",
    "Измененный список:  [4, 81, 1, 49, 2, 25, 0, 9, 49, 1, 9]  \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "f9a1a6c3-fd4c-4dc0-9178-b7335763a551",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Изначальный список: [4, 9, 1, 7, 2, 5, 0, 3, 7, 1, 3]\n",
      "Измененный список:  [4, 81, 1, 49, 2, 25, 0, 9, 49, 1, 9]\n"
     ]
    }
   ],
   "source": [
    "numbers = [4, 9, 1, 7, 2, 5, 0, 3, 7, 1, 3]\n",
    "print('Изначальный список:',numbers)\n",
    "i = 0\n",
    "for item in numbers:\n",
    "    if item % 2 == 1:\n",
    "        numbers[i] = numbers[i] ** 2\n",
    "    i += 1\n",
    "print('Измененный список: ', numbers)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fe8c290d-9d2a-4550-a2e2-95c833237a39",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
